In [45]:
import pandas as pd
roll_number_list = [0,1,2,3,4,5,6,7,8,9]
name_list = ['Aa','Bb','Cc','Dd','Ee','Ff','Gg','Hh','Ii','Kk']
gender_list = ['M','F','F','M','F','M','M','M','F','F']
marks1_list = [95,99,67,23,56,12,88,45,90,78]
marks2_list = [45,44,78,90,12,33,69,83,94,13]
marks3_list = [52,76,63,93,85,21,44,60,88,9]
dictionary = {'roll number':roll_number_list,'name':name_list,'gender':gender_list,'marks1':marks1_list,'marks2':marks2_list,'marks3':marks3_list}
df = pd.DataFrame(data=dictionary)

In [46]:
df

   roll number name gender  marks1  marks2  marks3
0            0   Aa      M      95      45      52
1            1   Bb      F      99      44      76
2            2   Cc      F      67      78      63
3            3   Dd      M      23      90      93
4            4   Ee      F      56      12      85
5            5   Ff      M      12      33      21
6            6   Gg      M      88      69      44
7            7   Hh      M      45      83      60
8            8   Ii      F      90      94      88
9            9   Kk      F      78      13       9

In [47]:
total_marks_list = []
for i in range(0,10):
    total_marks_list.append(marks3_list[i]+marks2_list[i]+marks1_list[i])
total_marks_list

[192, 219, 208, 206, 153, 66, 201, 188, 272, 100]

In [48]:
df['total marks']=total_marks_list

In [49]:
df

   roll number name gender  marks1  marks2  marks3  total marks
0            0   Aa      M      95      45      52          192
1            1   Bb      F      99      44      76          219
2            2   Cc      F      67      78      63          208
3            3   Dd      M      23      90      93          206
4            4   Ee      F      56      12      85          153
5            5   Ff      M      12      33      21           66
6            6   Gg      M      88      69      44          201
7            7   Hh      M      45      83      60          188
8            8   Ii      F      90      94      88          272
9            9   Kk      F      78      13       9          100

In [50]:

print("Lowest marks1:",df['marks1'].min())

Lowest marks1: 12

In [51]:

print("highest marks2:",df['marks2'].max())

highest marks2: 94

In [52]:

print("average is:",df['marks3'].mean())

average is: 59.1

In [53]:

print("Highest avg:",df['total marks'].max()/3,"\nStudent name:",df.loc[df['total marks']==df['total marks'].max()]['name'])

Highest avg: 90.66666666666667
Student name: 8    Ii
Name: name, dtype: object

In [54]:
count = 0
for i in range(0,10):
    if df['marks1'][i]<40 or df['marks2'][i]<40 or df['marks3'][i]<40:
        count +=1
print("number of fails:",count)

number of fails: 4